GopalSaraf/Practicals/PSDL/include/proc/pic18f63j90.inc
#define S6C1                             BANKMASK(LCDDATA6), 6, a
#define S6C2                             BANKMASK(LCDDATA12), 6, a
#define S6C3                             BANKMASK(LCDDATA18), 6, a
#define S7C0                             BANKMASK(LCDDATA0), 7, a
#define S7C1                             BANKMASK(LCDDATA6), 7, a
#define S7C2                             BANKMASK(LCDDATA12), 7, a
#define S7C3                             BANKMASK(LCDDATA18), 7, a
#define S8C0                             BANKMASK(LCDDATA1), 0, a
#define S8C1                             BANKMASK(LCDDATA7), 0, a
#define S8C2                             BANKMASK(LCDDATA13), 0, a
#define S8C3                             BANKMASK(LCDDATA19), 0, a
#define S9C0                             BANKMASK(LCDDATA1), 1, a
#define S9C1                             BANKMASK(LCDDATA7), 1, a
#define S9C2                             BANKMASK(LCDDATA13), 1, a
#define S9C3                             BANKMASK(LCDDATA19), 1, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SE0                              BANKMASK(LCDSE0), 0, a
#define SE00                             BANKMASK(LCDSE0), 0, a
#define SE01                             BANKMASK(LCDSE0), 1, a
#define SE02                             BANKMASK(LCDSE0), 2, a
#define SE03                             BANKMASK(LCDSE0), 3, a
#define SE04                             BANKMASK(LCDSE0), 4, a
#define SE05                             BANKMASK(LCDSE0), 5, a
#define SE06                             BANKMASK(LCDSE0), 6, a
#define SE07                             BANKMASK(LCDSE0), 7, a
#define SE08                             BANKMASK(LCDSE1), 0, a
#define SE09                             BANKMASK(LCDSE1), 1, a
#define SE1                              BANKMASK(LCDSE0), 1, a
#define SE10                             BANKMASK(LCDSE1), 2, a
#define SE11                             BANKMASK(LCDSE1), 3, a
#define SE12                             BANKMASK(LCDSE1), 4, a
#define SE13                             BANKMASK(LCDSE1), 5, a
#define SE14                             BANKMASK(LCDSE1), 6, a
#define SE15                             BANKMASK(LCDSE1), 7, a
#define SE16                             BANKMASK(LCDSE2), 0, a
#define SE17                             BANKMASK(LCDSE2), 1, a
#define SE18                             BANKMASK(LCDSE2), 2, a
#define SE19                             BANKMASK(LCDSE2), 3, a
#define SE2                              BANKMASK(LCDSE0), 2, a
#define SE20                             BANKMASK(LCDSE2), 4, a
#define SE21                             BANKMASK(LCDSE2), 5, a
#define SE22                             BANKMASK(LCDSE2), 6, a
#define SE23                             BANKMASK(LCDSE2), 7, a
#define SE24                             BANKMASK(LCDSE3), 0, a
#define SE25                             BANKMASK(LCDSE3), 1, a
#define SE26                             BANKMASK(LCDSE3), 2, a
#define SE27                             BANKMASK(LCDSE3), 3, a
#define SE28                             BANKMASK(LCDSE3), 4, a
#define SE29                             BANKMASK(LCDSE3), 5, a
#define SE3                              BANKMASK(LCDSE0), 3, a
#define SE30                             BANKMASK(LCDSE3), 6, a
#define SE31                             BANKMASK(LCDSE3), 7, a
#define SE32                             BANKMASK(LCDSE4), 0, a
#define SE4                              BANKMASK(LCDSE0), 4, a
#define SE5                              BANKMASK(LCDSE0), 5, a
#define SE6                              BANKMASK(LCDSE0), 6, a
#define SE7                              BANKMASK(LCDSE0), 7, a
#define SE8                              BANKMASK(LCDSE1), 0, a
#define SE9                              BANKMASK(LCDSE1), 1, a
#define SEG0                             BANKMASK(PORTD), 0, a
#define SEG0COM0                         BANKMASK(LCDDATA0), 0, a
#define SEG0COM1                         BANKMASK(LCDDATA6), 0, a
#define SEG0COM2                         BANKMASK(LCDDATA12), 0, a
#define SEG0COM3                         BANKMASK(LCDDATA18), 0, a
#define SEG1                             BANKMASK(PORTD), 1, a
#define SEG10                            BANKMASK(PORTB), 3, a
#define SEG10COM0                        BANKMASK(LCDDATA1), 2, a
#define SEG10COM1                        BANKMASK(LCDDATA7), 2, a
#define SEG10COM2                        BANKMASK(LCDDATA13), 2, a
#define SEG10COM3                        BANKMASK(LCDDATA19), 2, a
#define SEG11                            BANKMASK(PORTB), 4, a
#define SEG11COM0                        BANKMASK(LCDDATA1), 3, a
#define SEG11COM1                        BANKMASK(LCDDATA7), 3, a
#define SEG11COM2                        BANKMASK(LCDDATA13), 3, a
#define SEG11COM3                        BANKMASK(LCDDATA19), 3, a
#define SEG12                            BANKMASK(PORTC), 5, a
#define SEG12COM0                        BANKMASK(LCDDATA1), 4, a
#define SEG12COM1                        BANKMASK(LCDDATA7), 4, a
#define SEG12COM2                        BANKMASK(LCDDATA13), 4, a
#define SEG12COM3                        BANKMASK(LCDDATA19), 4, a
#define SEG13                            BANKMASK(PORTC), 2, a
#define SEG13COM0                        BANKMASK(LCDDATA1), 5, a
#define SEG13COM1                        BANKMASK(LCDDATA7), 5, a
#define SEG13COM2                        BANKMASK(LCDDATA13), 5, a
#define SEG13COM3                        BANKMASK(LCDDATA19), 5, a
#define SEG14                            BANKMASK(PORTA), 4, a
#define SEG14COM0                        BANKMASK(LCDDATA1), 6, a
#define SEG14COM1                        BANKMASK(LCDDATA7), 6, a
#define SEG14COM2                        BANKMASK(LCDDATA13), 6, a
#define SEG14COM3                        BANKMASK(LCDDATA19), 6, a
#define SEG15                            BANKMASK(PORTA), 5, a
#define SEG15COM0                        BANKMASK(LCDDATA1), 7, a
#define SEG15COM1                        BANKMASK(LCDDATA7), 7, a
#define SEG15COM2                        BANKMASK(LCDDATA13), 7, a
#define SEG15COM3                        BANKMASK(LCDDATA19), 7, a
#define SEG16                            BANKMASK(PORTC), 4, a
#define SEG16COM0                        BANKMASK(LCDDATA2), 0, a
#define SEG16COM1                        BANKMASK(LCDDATA8), 0, a
#define SEG16COM2                        BANKMASK(LCDDATA14), 0, a
#define SEG16COM3                        BANKMASK(LCDDATA20), 0, a
#define SEG17                            BANKMASK(PORTC), 3, a
#define SEG17COM0                        BANKMASK(LCDDATA2), 1, a
#define SEG17COM1                        BANKMASK(LCDDATA8), 1, a
#define SEG17COM2                        BANKMASK(LCDDATA14), 1, a
#define SEG17COM3                        BANKMASK(LCDDATA20), 1, a
#define SEG18                            BANKMASK(PORTA), 1, a
#define SEG18COM0                        BANKMASK(LCDDATA2), 2, a
#define SEG18COM1                        BANKMASK(LCDDATA8), 2, a
#define SEG18COM2                        BANKMASK(LCDDATA14), 2, a
#define SEG18COM3                        BANKMASK(LCDDATA20), 2, a
#define SEG19                            BANKMASK(PORTF), 1, a
#define SEG19COM0                        BANKMASK(LCDDATA2), 3, a
#define SEG19COM1                        BANKMASK(LCDDATA8), 3, a
#define SEG19COM2                        BANKMASK(LCDDATA14), 3, a
#define SEG19COM3                        BANKMASK(LCDDATA20), 3, a
#define SEG1COM0                         BANKMASK(LCDDATA0), 1, a
#define SEG1COM1                         BANKMASK(LCDDATA6), 1, a
#define SEG1COM2                         BANKMASK(LCDDATA12), 1, a
#define SEG1COM3                         BANKMASK(LCDDATA18), 1, a
#define SEG2                             BANKMASK(PORTD), 2, a
#define SEG20                            BANKMASK(PORTF), 2, a
#define SEG20COM0                        BANKMASK(LCDDATA2), 4, a
#define SEG20COM1                        BANKMASK(LCDDATA8), 4, a
#define SEG20COM2                        BANKMASK(LCDDATA14), 4, a
#define SEG20COM3                        BANKMASK(LCDDATA20), 4, a
#define SEG21                            BANKMASK(PORTF), 3, a
#define SEG21COM0                        BANKMASK(LCDDATA2), 5, a
#define SEG21COM1                        BANKMASK(LCDDATA8), 5, a
#define SEG21COM2                        BANKMASK(LCDDATA14), 5, a
#define SEG21COM3                        BANKMASK(LCDDATA20), 5, a
#define SEG22                            BANKMASK(PORTF), 4, a
#define SEG22COM0                        BANKMASK(LCDDATA2), 6, a
#define SEG22COM1                        BANKMASK(LCDDATA8), 6, a
#define SEG22COM2                        BANKMASK(LCDDATA14), 6, a
#define SEG22COM3                        BANKMASK(LCDDATA20), 6, a
#define SEG23                            BANKMASK(PORTF), 5, a
#define SEG23COM0                        BANKMASK(LCDDATA2), 7, a
#define SEG23COM1                        BANKMASK(LCDDATA8), 7, a
#define SEG23COM2                        BANKMASK(LCDDATA14), 7, a
#define SEG23COM3                        BANKMASK(LCDDATA20), 7, a
#define SEG24                            BANKMASK(PORTF), 6, a
#define SEG24COM0                        BANKMASK(LCDDATA3), 0, a
#define SEG24COM1                        BANKMASK(LCDDATA9), 0, a
#define SEG24COM2                        BANKMASK(LCDDATA15), 0, a
#define SEG24COM3                        BANKMASK(LCDDATA21), 0, a
#define SEG25                            BANKMASK(PORTF), 7, a
#define SEG25COM0                        BANKMASK(LCDDATA3), 1, a
#define SEG25COM1                        BANKMASK(LCDDATA9), 1, a
#define SEG25COM2                        BANKMASK(LCDDATA15), 1, a
#define SEG25COM3                        BANKMASK(LCDDATA21), 1, a
#define SEG26                            BANKMASK(PORTG), 4, a
#define SEG26COM0                        BANKMASK(LCDDATA3), 2, a
#define SEG26COM1                        BANKMASK(LCDDATA9), 2, a
#define SEG26COM2                        BANKMASK(LCDDATA15), 2, a
#define SEG26COM3                        BANKMASK(LCDDATA21), 2, a
#define SEG27                            BANKMASK(PORTC), 6, a
#define SEG27COM0                        BANKMASK(LCDDATA3), 3, a
#define SEG27COM1                        BANKMASK(LCDDATA9), 3, a
#define SEG27COM2                        BANKMASK(LCDDATA15), 3, a
#define SEG27COM3                        BANKMASK(LCDDATA21), 3, a
#define SEG28                            BANKMASK(PORTC), 7, a
#define SEG28COM0                        BANKMASK(LCDDATA3), 4, a
#define SEG28COM1                        BANKMASK(LCDDATA9), 4, a
#define SEG28COM2                        BANKMASK(LCDDATA15), 4, a
#define SEG28COM3                        BANKMASK(LCDDATA21), 4, a
#define SEG29                            BANKMASK(PORTB), 5, a
#define SEG29COM0                        BANKMASK(LCDDATA3), 5, a
#define SEG29COM1                        BANKMASK(LCDDATA9), 5, a
#define SEG29COM2                        BANKMASK(LCDDATA15), 5, a
#define SEG29COM3                        BANKMASK(LCDDATA21), 5, a
#define SEG2COM0                         BANKMASK(LCDDATA0), 2, a
#define SEG2COM1                         BANKMASK(LCDDATA6), 2, a
#define SEG2COM2                         BANKMASK(LCDDATA12), 2, a
#define SEG2COM3                         BANKMASK(LCDDATA18), 2, a
#define SEG3                             BANKMASK(PORTD), 3, a
#define SEG30                            BANKMASK(PORTB), 0, a
#define SEG30COM0                        BANKMASK(LCDDATA3), 6, a
#define SEG30COM1                        BANKMASK(LCDDATA9), 6, a
#define SEG30COM2                        BANKMASK(LCDDATA15), 6, a
#define SEG30COM3                        BANKMASK(LCDDATA21), 6, a
#define SEG31                            BANKMASK(PORTE), 7, a
#define SEG31COM0                        BANKMASK(LCDDATA3), 7, a
#define SEG31COM1                        BANKMASK(LCDDATA9), 7, a
#define SEG31COM2                        BANKMASK(LCDDATA15), 7, a
#define SEG31COM3                        BANKMASK(LCDDATA21), 7, a
#define SEG32                            BANKMASK(PORTC), 1, a
#define SEG32COM0                        BANKMASK(LCDDATA4), 0, a
#define SEG32COM1                        BANKMASK(LCDDATA10), 0, a
#define SEG32COM2                        BANKMASK(LCDDATA16), 0, a
#define SEG32COM3                        BANKMASK(LCDDATA22), 0, a
#define SEG3COM0                         BANKMASK(LCDDATA0), 3, a
#define SEG3COM1                         BANKMASK(LCDDATA6), 3, a
#define SEG3COM2                         BANKMASK(LCDDATA12), 3, a
#define SEG3COM3                         BANKMASK(LCDDATA18), 3, a
#define SEG4                             BANKMASK(PORTD), 4, a
#define SEG4COM0                         BANKMASK(LCDDATA0), 4, a
#define SEG4COM1                         BANKMASK(LCDDATA6), 4, a
#define SEG4COM2                         BANKMASK(LCDDATA12), 4, a
#define SEG4COM3                         BANKMASK(LCDDATA18), 4, a
#define SEG5                             BANKMASK(PORTD), 5, a
#define SEG5COM0                         BANKMASK(LCDDATA0), 5, a
#define SEG5COM1                         BANKMASK(LCDDATA6), 5, a
#define SEG5COM2                         BANKMASK(LCDDATA12), 5, a
#define SEG5COM3                         BANKMASK(LCDDATA18), 5, a
#define SEG6                             BANKMASK(PORTD), 6, a
#define SEG6COM0                         BANKMASK(LCDDATA0), 6, a
#define SEG6COM1                         BANKMASK(LCDDATA6), 6, a
#define SEG6COM2                         BANKMASK(LCDDATA12), 6, a
#define SEG6COM3                         BANKMASK(LCDDATA18), 6, a
#define SEG7                             BANKMASK(PORTD), 7, a
#define SEG7COM0                         BANKMASK(LCDDATA0), 7, a
#define SEG7COM1                         BANKMASK(LCDDATA6), 7, a
#define SEG7COM2                         BANKMASK(LCDDATA12), 7, a
#define SEG7COM3                         BANKMASK(LCDDATA18), 7, a
#define SEG8                             BANKMASK(PORTB), 1, a
#define SEG8COM0                         BANKMASK(LCDDATA1), 0, a
#define SEG8COM1                         BANKMASK(LCDDATA7), 0, a
#define SEG8COM2                         BANKMASK(LCDDATA13), 0, a
#define SEG8COM3                         BANKMASK(LCDDATA19), 0, a
#define SEG9                             BANKMASK(PORTB), 2, a
#define SEG9COM0                         BANKMASK(LCDDATA1), 1, a
#define SEG9COM1                         BANKMASK(LCDDATA7), 1, a
#define SEG9COM2                         BANKMASK(LCDDATA13), 1, a
#define SEG9COM3                         BANKMASK(LCDDATA19), 1, a
#define SEGEN0                           BANKMASK(LCDSE0), 0, a
#define SEGEN1                           BANKMASK(LCDSE0), 1, a
#define SEGEN10                          BANKMASK(LCDSE1), 2, a
#define SEGEN11                          BANKMASK(LCDSE1), 3, a
#define SEGEN12                          BANKMASK(LCDSE1), 4, a
#define SEGEN13                          BANKMASK(LCDSE1), 5, a
#define SEGEN14                          BANKMASK(LCDSE1), 6, a
#define SEGEN15                          BANKMASK(LCDSE1), 7, a
#define SEGEN16                          BANKMASK(LCDSE2), 0, a
#define SEGEN17                          BANKMASK(LCDSE2), 1, a
#define SEGEN18                          BANKMASK(LCDSE2), 2, a
#define SEGEN19                          BANKMASK(LCDSE2), 3, a
#define SEGEN2                           BANKMASK(LCDSE0), 2, a
#define SEGEN20                          BANKMASK(LCDSE2), 4, a
#define SEGEN21                          BANKMASK(LCDSE2), 5, a
#define SEGEN22                          BANKMASK(LCDSE2), 6, a
#define SEGEN23                          BANKMASK(LCDSE2), 7, a
#define SEGEN24                          BANKMASK(LCDSE3), 0, a
#define SEGEN25                          BANKMASK(LCDSE3), 1, a
#define SEGEN26                          BANKMASK(LCDSE3), 2, a
#define SEGEN27                          BANKMASK(LCDSE3), 3, a
#define SEGEN28                          BANKMASK(LCDSE3), 4, a
#define SEGEN29                          BANKMASK(LCDSE3), 5, a
#define SEGEN3                           BANKMASK(LCDSE0), 3, a
#define SEGEN30                          BANKMASK(LCDSE3), 6, a
#define SEGEN31                          BANKMASK(LCDSE3), 7, a
#define SEGEN32                          BANKMASK(LCDSE4), 0, a
#define SEGEN4                           BANKMASK(LCDSE0), 4, a
#define SEGEN5                           BANKMASK(LCDSE0), 5, a
#define SEGEN6                           BANKMASK(LCDSE0), 6, a
#define SEGEN7                           BANKMASK(LCDSE0), 7, a
#define SEGEN8                           BANKMASK(LCDSE1), 0, a
#define SEGEN9                           BANKMASK(LCDSE1), 1, a
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SEN1                             BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SLPEN                            BANKMASK(LCDCON), 6, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SMP1                             BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPIOD                            BANKMASK(TRISG), 7, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS1                              BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPEN1                           BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM01                           BANKMASK(SSPCON1), 0, a
#define SSPM012                          BANKMASK(LCDDATA12), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM11                           BANKMASK(SSPCON1), 1, a
#define SSPM112                          BANKMASK(LCDDATA12), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM21                           BANKMASK(SSPCON1), 2, a
#define SSPM212                          BANKMASK(LCDDATA12), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPM31                           BANKMASK(SSPCON1), 3, a
#define SSPM312                          BANKMASK(LCDDATA12), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define SSPOV1                           BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define START1                           BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define STOP1                            BANKMASK(SSPSTAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA1), 4, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0PS3                            BANKMASK(T0CON), 3, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T13CKI                           BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1RUN                            BANKMASK(T1CON), 6, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CCP1                           BANKMASK(T3CON), 3, a
#define T3CCP2                           BANKMASK(T3CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS019                        BANKMASK(LCDDATA19), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CKPS119                        BANKMASK(LCDDATA19), 5, a
#define T3INSYNC                         BANKMASK(T3CON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T3SYNC                           BANKMASK(T3CON), 2, a
#define T4CKPS016                        BANKMASK(LCDDATA16), 0, a
#define T4CKPS116                        BANKMASK(LCDDATA16), 1, a
#define T4OUTPS016                       BANKMASK(LCDDATA16), 3, a
#define T4OUTPS116                       BANKMASK(LCDDATA16), 4, a
